/**
 * ジョブの設定値
 */
bq.params.Jobs = {
    // すっぴん
    NOVICE: {
        // 1ポイントにつき上昇する能力値の倍率
        BASE_STATUS_RATE: {
            CON: 18.7, // HP
            INT: 5.9,  // BP
            STR: 2.3,  // 攻撃力
            DEF: 2.5,  // 防御力
            SNS: 3.7,  // センス
            LUK: 3.9   // 運の良さ
        },

        /**
         * 各レベルに必要な経験値テーブル
         * arrのindexがlevelに対応する
         * @type {Array.<number>}
         */
        Exp:[-1,
            0,     // LV1
            5,
            15,
            30,
            55,
            70,
            100,
            140,
            170,
            210,   // LV10
            238,
            300,
            374,
            486,
            622,
            785,
            977,
            1201,
            1501,
            1834,  // LV20
            2201,
            2605,
            3047,
            3679,
            4353,
            5073,
            5848,
            6682,
            7991,
            9373,
            10842, // LV30
            12421,
            14124,
            17252,
            20554,
            24080,
            27901,
            32067,
            40508,
            49419,
            58925, // LV40
            69239,
            80486,
            106695,
            134335,
            163904,
            196150,
            231571,
            253204,
            280932,
            310000 // LV50
        ]
    }
};